Revit 2024 API
CopyPasteOptions Methods
The CopyPasteOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDuplicateTypeNamesHandler
 Returns current duplicate type names handler or null if none is set.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetDuplicateTypeNamesHandler
 Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
CopyPasteOptions Class
Autodesk.Revit.DB Namespace